{
  "version": 1,
  "language": "de",
  "lastUpdated": "2025-03-14T12:00:00Z",
  "configuration": {
    "refreshIntervalHours": 24,
    "maxEventsToShow": 10,
    "defaultCategory": "all"
  },
  "events": [
    {
      "id": "article-001",
      "title": "Der Himmel dieser Woche auf einen Blick, 7.–16. März",
      "description": "FREITAG, 7. MÄRZ\n\nHeute Abend scheint der Mond, kurz nach dem ersten Viertel (Halbmondform), am Himmel nahe Mars und den Zwillingssternen Castor und Pollux. Im Laufe der Nacht scheinen sie alle im Uhrzeigersinn über den Himmel zu rotieren, während sich die Erde dreht.\n\nSAMSTAG, 8. MÄRZ\n\nDer Mond bewegt sich heute Nacht näher an Mars und die Zwillingssterne heran. Beobachten Sie, wie der Mond im Vergleich zu den Hintergrundsternen seine Position verändert, während die Stunden vergehen. Der Mond bewegt sich in seiner Umlaufbahn stündlich etwa um seine eigene Breite nach Osten.\n\nDie Sommerzeit beginnt am Sonntagmorgen, den 9. März, um 2:00 Uhr. Denken Sie daran, Ihre Uhren eine Stunde vorzustellen (\"spring ahead\").\n\nSONNTAG, 9. MÄRZ\n\nDer Frühling ist noch ein paar Wochen entfernt, aber der helle Frühlingsstern Arktur geht bereits gegen 21 Uhr im Ostnordosten auf. Um ihn zu finden, suchen Sie nach dem Großen Wagen hoch im Nordosten, dann folgen Sie der Kurve seines Griffs nach unten und nach rechts.\n\nMONTAG, 10. MÄRZ\n\nMars, Pollux und Castor im Sternbild Zwillinge ziehen nach Einbruch der Dunkelheit fast direkt über den Kopf, wenn Sie in den mittleren nördlichen Breitengraden leben [Gebiete wie der nördliche Teil der Vereinigten Staaten oder Mitteleuropa]. Mars ist der hellste der drei und hat eine rötliche Farbe.\n\nDIENSTAG, 11. MÄRZ\n\nDer Mond erscheint heute Nacht in der Nähe des hellen Sterns Regulus. Beobachten Sie, wie sie sich im Laufe der Nacht näherkommen und bis zum frühen Morgengrauen nur noch 1° voneinander entfernt sind (etwa die Breite Ihres kleinen Fingers, wenn Sie ihn auf Armlänge halten).\n\nDer Stern Algol wird gegen 23:37 Uhr EDT am dunkelsten sein. Algol ist ein besonderer Stern, der regelmäßig seine Helligkeit ändert, weil es sich eigentlich um zwei Sterne handelt, die sich aus unserer Sicht auf der Erde gegenseitig verdunkeln.\n\nMITTWOCH, 12. MÄRZ\n\nDer helle Sirius (der hellste Stern an unserem Nachthimmel) steht jetzt bei Einbruch der Dunkelheit genau im Süden. Sirius bildet den unteren Punkt des Winterdreiecks. Die anderen beiden Sterne des Dreiecks sind der orangefarbene Beteigeuze (oben rechts von Sirius) und Prokyon (oben links von Sirius).\n\nDONNERSTAG, 13. MÄRZ\n\nHeute Nacht wird eine totale Mondfinsternis zu sehen sein, die von Nord- und Südamerika, Westeuropa und Westafrika aus sichtbar ist.\n\nFür Menschen in Nordamerika ereignet sich die Finsternis spät in der Nacht. Die partielle Finsternis (wenn der Erdschatten beginnt, den Mond zu bedecken) beginnt um 1:09 Uhr EDT am Freitagmorgen. Die totale Finsternis (wenn der Mond vollständig im Erdschatten liegt) beginnt um 2:26 Uhr EDT, erreicht ihre Mitte um 2:59 Uhr EDT und endet um 3:32 Uhr EDT. Die partielle Finsternis endet um 4:48 Uhr EDT.\n\nFREITAG, 14. MÄRZ\n\nDer Vollmond geht heute in der Dämmerung auf. Wenn er nach Einbruch der Dunkelheit höher steigt, suchen Sie unterhalb von ihm nach dem hellen Stern Spica.\n\nAlgol wird heute Nacht wieder am dunkelsten sein, gegen 20:26 Uhr EDT.\n\nSAMSTAG, 15. MÄRZ\n\nHeute Nacht geht der Mond (der nun beginnt abzunehmen oder zu schrumpfen) gegen Ende der Dämmerung auf, wobei der Stern Spica weniger als eine Faustbreite darunter steht, wenn man ihn auf Armlänge hält.\n\nSONNTAG, 16. MÄRZ\n\nDer Mond nimmt weiter ab und geht jetzt etwa eine Stunde nach völliger Dunkelheit auf, wobei Spica ihm in den Himmel folgt.\nQuelle: Sky & Telescope",
      "credit": "Von Alan MacRobert (7. März 2025)",
      "shortDescription": "Ihr wöchentlicher Leitfaden zur Beobachtung der Sterne und Planeten vom 7. bis 16. März",
      "dateTime": "2025-03-07T00:00:00Z",
      "endDateTime": "2025-03-16T23:59:59Z",
      "category": "guide",
      "priority": 1,
      "expirationDate": "2025-03-17T12:00:00Z",
      "images": [
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/weekly_1.jpg",
          "type": "main",
          "altText": "Woche 1 Himmel"
        },
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/weekly_2.jpg",
          "type": "map",
          "altText": "Woche 2 Himmel"
        },
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/weekly_3.jpg",
          "type": "photo",
          "altText": "Woche 3 Himmel"
        }
      ],
      "links": [
        {
          "text": "Vollständigen Artikel ansehen",
          "url": "https://skyandtelescope.org/observing/this-weeks-sky-at-a-glance-march-7-16-2025",
          "isExternal": true
        },
        {
          "text": "Beobachtungserinnerungen einstellen",
          "url": "planetspotter://calendar?week=mar7-16-2025",
          "isAppLink": true
        }
      ],
      "requiresPremium": false,
      "isHighlighted": true
    },
    {
      "id": "article-002",
      "title": "Venus wechselt vom Abend- zum Morgenstern",
      "description": "Die Venus wird bald aus unserem Abendhimmel verschwinden. Wenn Sie diesen hellen Planeten in letzter Zeit nicht betrachtet haben, läuft Ihnen die Zeit davon! Am 12. März wird die Venus nur knapp 18° von der Sonne entfernt sein (diese Entfernung wird als Elongation bezeichnet) und sich täglich um mehr als 1° der Sonne nähern. Während sich die Venus entfernt, wird sie in der Nähe des Merkur erscheinen. Die beiden inneren Planeten werden am 12. März am nächsten beieinander sein (5,5° Abstand).\n\nAm 23. März wird die Venus zwischen der Erde und der Sonne hindurchziehen (untere Konjunktion genannt) und dann in den Morgenhimmel übergehen, wodurch sie vom \"Abendstern\" zum \"Morgenstern\" wird. Die alten Römer nannten die Venus \"Lucifer\", wenn sie am Morgen zu sehen war, und \"Vesper\", wenn sie am Abend zu sehen war.\n\nNormalerweise ist die Venus für etwa eine Woche um die Konjunktion herum im Sonnenglanz verborgen. Während dieser Zeit könnten vorsichtige Beobachter versuchen, sie tagsüber mit Teleskopen zu erspähen, wobei sie sehr darauf achten müssen, nicht in die Sonne zu blicken. Wenn die Venus der Erde am nächsten ist, erscheint sie in Teleskopen am größten und zeigt eine super-dünne Sichelform.\n\nUm die Konjunktion herum, wenn die Venus fast in der gleichen Richtung wie die Sonne erscheint, können sich die Spitzen (oder Hörner) der Venussichel über 180° hinaus erstrecken, weil das Sonnenlicht durch die Atmosphäre der Venus gebeugt wird. Achten Sie auf diese Verlängerungen, wenn die Venus weniger als 2,5% beleuchtet ist (vom 16. bis 29. März). Die Venus wird am 22. und 23. März nur zu 1,0% beleuchtet sein.\n\nDie Venus wird ihren nördlichsten Punkt von der Sonnenbahn (der Ekliptik) am 18. März erreichen und 8,5° nördlich stehen. Da dies kurz vor der Konjunktion geschieht, wird die Venus weit nördlich der Sonne vorbeiziehen, was es einfacher (und sicherer) macht, sie bei Tageslicht zu erspähen.\n\nWenn Sie ein sehr scharfes Auge haben, könnten Sie sogar in der Lage sein, die Sichelform der Venus ohne Teleskop zu sehen. Das menschliche Auge kann Details so klein wie 60 Bogensekunden (oder 1 Bogenminute) unterscheiden. Die Venus erreicht am 22. und 23. März fast genau diese Größe (59,5 Bogensekunden).\n\nWeil die Venus so weit nördlich der Sonnenbahn steht, haben Beobachter in mittleren nördlichen Breitengraden eine seltene Chance, die Venus am Morgenhimmel zu sehen, während sie technisch gesehen noch der Abendstern ist. Suchen Sie nach dem letzten Erscheinen der Venus am Abend um den 18. März. Dann können Sie am 21. März beginnen, nach ihr vor Sonnenaufgang zu suchen, aber sie wird sehr tief am Horizont sein (\"im Schlamm\").\nQuelle: Sky & Telescope",
      "credit": "Von Bob King (12. März 2025)",
      "shortDescription": "Wie man beobachtet, wie die Venus vom Abend- zum Morgenhimmel wechselt",
      "dateTime": "2025-03-12T00:00:00Z",
      "endDateTime": "2025-03-23T23:59:59Z",
      "category": "planets",
      "priority": 2,
      "expirationDate": "2025-03-24T12:00:00Z",
      "images": [
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/venus_1.jpg",
          "type": "main",
          "altText": "Venus von der Erde aus gesehen"
        },
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/venus_2.jpg",
          "type": "photo",
          "altText": "Venus-Bahn im Jahresverlauf"
        },
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/venus_3.jpg",
          "type": "map",
          "altText": "Venus im Weltraum"
        }
      ],
      "links": [
        {
          "text": "Vollständigen Artikel ansehen",
          "url": "https://skyandtelescope.org/observing/venus-evening-to-morning-star-2025",
          "isExternal": true
        },
        {
          "text": "Beobachtungserinnerung einstellen",
          "url": "planetspotter://reminder?event=venus-conjunction-2025",
          "isAppLink": true
        }
      ],
      "requiresPremium": false,
      "isHighlighted": true
    },
    {
      "id": "article-003",
      "title": "Beobachten Sie heute Nacht die totale Mondfinsternis (13.-14. März)",
      "description": "Eine erstaunliche totale Mondfinsternis wird heute Nacht in Nord- und Südamerika, Westeuropa und Westafrika sichtbar sein.\n\nFür Menschen in Nordamerika ereignet sich die Finsternis spät in der Nacht. Die partielle Finsternis (wenn der Erdschatten den Mond zum ersten Mal berührt) beginnt um 1:09 Uhr am Freitagmorgen EDT. Die totale Finsternis (wenn der Mond vollständig im Erdschatten liegt) beginnt um 2:26 Uhr EDT, erreicht ihre Mitte um 2:59 Uhr EDT und endet um 3:32 Uhr EDT. Die partielle Finsternis endet vollständig um 4:48 Uhr EDT.\n\nWährend einer Mondfinsternis positioniert sich die Erde direkt zwischen der Sonne und dem Vollmond und wirft den Schatten unseres Planeten auf den Mond. Der Mond nimmt während der Totalität (der Zeit, in der er vollständig im Erdschatten liegt) eine kupferrote Farbe an, die etwa 66 Minuten dauert. Diese rote Farbe entsteht, weil die Erdatmosphäre das Sonnenlicht beugt und die meisten Farben herausfiltert, außer Rot, das den Mond erreicht - es ist, als ob alle Sonnenauf- und -untergänge der Erde gleichzeitig auf den Mond projiziert würden!\n\nDer Mond wird sich nahe seinem fernsten Punkt von der Erde in seiner Umlaufbahn befinden (Apogäum genannt), wodurch er etwas kleiner erscheint als ein durchschnittlicher Vollmond (manchmal \"Minimond\" genannt).\n\nDies ist die erste totale Mondfinsternis, die seit 2022 in dieser Region sichtbar ist. Sie benötigen keine spezielle Ausrüstung, um eine Mondfinsternis zu beobachten, aber mit einem Fernglas oder einem kleinen Teleskop können Sie während der Finsternis mehr Details auf der Mondoberfläche sehen.\n\nIm Gegensatz zu Sonnenfinsternissen sind Mondfinsternisse vollkommen sicher, um sie mit bloßem Auge zu betrachten. Sie benötigen keinen speziellen Augenschutz, um eine Mondfinsternis zu betrachten.\nQuelle: Sky & Telescope",
      "credit": "Von den Sky & Telescope Redakteuren (13. März 2025)",
      "shortDescription": "Wie man die heutige totale Mondfinsternis beobachtet",
      "dateTime": "2025-03-13T21:00:00Z",
      "endDateTime": "2025-03-14T09:30:00Z",
      "category": "eclipse",
      "priority": 3,
      "expirationDate": "2025-03-15T12:00:00Z",
      "images": [
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/eclipse_1.jpg",
          "type": "main",
          "altText": "Sequenz der totalen Mondfinsternis"
        },
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/eclipse_2.jpg",
          "type": "map",
          "altText": "Weltkarte mit Sichtbarkeit der Finsternis"
        },
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/eclipse_3.jpg",
          "type": "photo",
          "altText": "Erdschatten auf der Mondoberfläche"
        }
      ],
      "links": [
        {
          "text": "Vollständigen Artikel ansehen",
          "url": "https://skyandtelescope.org/observing/total-lunar-eclipse-march-2025",
          "isExternal": true
        },
        {
          "text": "Beobachtungserinnerung einstellen",
          "url": "planetspotter://reminder?event=lunar-eclipse-2025",
          "isAppLink": true
        }
      ],
      "requiresPremium": false,
      "isHighlighted": true
    }
  ],
  "categories": [
    {
      "id": "all",
      "name": "Alle Artikel",
      "icon": "star.fill"
    },
    {
      "id": "guide",
      "name": "Himmelsleitfäden",
      "icon": "calendar"
    },
    {
      "id": "planets",
      "name": "Planeten",
      "icon": "globe"
    },
    {
      "id": "eclipse",
      "name": "Finsternisse",
      "icon": "moon.circle.fill"
    }
  ],
  "acknowledgement": "Artikelbeschreibungen wurden adaptiert aus Materialien, die von Sky & Telescope Magazin (www.skyandtelescope.org) veröffentlicht wurden. Diese Adaptionen werden für Bildungszwecke verwendet mit angemessener Zuschreibung zu den Originalquellen. Bilder und spezifische Zeitangaben sollten mit lokalen astronomischen Ressourcen überprüft werden."
}
