{
  "version": 1,
  "language": "en",
  "lastUpdated": "2025-03-14T12:00:00Z",
  "configuration": {
    "refreshIntervalHours": 24,
    "maxEventsToShow": 10,
    "defaultCategory": "all"
  },
  "events": [
    {
      "id": "article-001",
      "title": "This Week's Sky at a Glance, March 7–16",
      "description": "FRIDAY, MARCH 7\n\nThis evening the Moon, just past first quarter (half-moon shape), shines in the sky near Mars and the twin stars Castor and Pollux. As the night goes on, they all appear to rotate clockwise across the sky as Earth rotates.\n\nSATURDAY, MARCH 8\n\nThe Moon moves closer to Mars and the twin stars tonight. Watch how the Moon changes position compared to the background stars as hours pass. The Moon moves eastward in its orbit by about its own width every hour.\n\nDaylight-saving time starts at 2:00 a.m. Sunday morning March 9. Remember to set your clocks forward one hour (\"spring ahead\").\n\nSUNDAY, MARCH 9\n\nSpring is still a couple weeks away, but the bright spring star Arcturus is already rising in the east-northeast around 9 p.m. To find it, look for the Big Dipper high in the northeast, then follow the curve of its handle downward and to the right.\n\nMONDAY, MARCH 10\n\nMars, Pollux, and Castor in the constellation Gemini [the Twins] pass almost straight overhead after nightfall if you live in the mid-northern latitudes [areas like the northern United States or central Europe]. Mars is the brightest of the three and has a reddish color.\n\nTUESDAY, MARCH 11\n\nThe Moon appears near the bright star Regulus tonight. Watch as they get closer throughout the night, ending up just 1° apart (about the width of your pinky finger held at arm's length) by early dawn.\n\nThe star Algol will be at its dimmest around 11:37 p.m. EDT. Algol is a special star that changes brightness regularly because it's actually two stars that eclipse each other from our view on Earth.\n\nWEDNESDAY, MARCH 12\n\nBright Sirius (the brightest star in our night sky) is now due south as darkness falls. Sirius forms the bottom point of the Winter Triangle. The triangle's other two stars are orange Betelgeuse (to Sirius's upper right) and Procyon (to Sirius's upper left).\n\nTHURSDAY, MARCH 13\n\nThere will be a total lunar eclipse tonight visible from North and South America, western Europe, and western Africa.\n\nFor people in North America, the eclipse happens late at night. The partial eclipse (when Earth's shadow starts covering the Moon) begins at 1:09 a.m. Friday morning EDT. The total eclipse (when the Moon is fully in Earth's shadow) starts at 2:26 a.m. EDT, reaches its middle at 2:59 a.m. EDT, and ends at 3:32 a.m. EDT. The partial eclipse ends at 4:48 a.m. EDT.\n\nFRIDAY, MARCH 14\n\nThe full Moon rises at twilight today. As it climbs higher after dark, look below it for the bright star Spica to appear.\n\nAlgol will be at its dimmest again tonight, around 8:26 p.m. EDT.\n\nSATURDAY, MARCH 15\n\nTonight the Moon (now starting to wane or shrink) rises around the end of twilight, with the star Spica less than a fist-width below it when held at arm's length.\n\nSUNDAY, MARCH 16\n\nThe Moon continues to wane and now rises about an hour after full darkness, with Spica following it up into the sky.\nCredit: Sky & Telescope",
      "credit": "By Alan MacRobert (March 7, 2025)",
      "shortDescription": "Your weekly guide to watching the stars and planets from March 7 to 16",
      "dateTime": "2025-03-07T00:00:00Z",
      "endDateTime": "2025-03-16T23:59:59Z",
      "category": "guide",
      "priority": 1,
      "expirationDate": "2025-03-17T12:00:00Z",
      "images": [
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/weekly_1.jpg",
          "type": "main",
          "altText": "Week 1 Sky"
        },
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/weekly_2.jpg",
          "type": "map",
          "altText": "Week 2 Sky"
        },
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/weekly_3.jpg",
          "type": "photo",
          "altText": "Week 3 Sky"
        }
      ],
      "links": [
        {
          "text": "View full article",
          "url": "https://skyandtelescope.org/observing/this-weeks-sky-at-a-glance-march-7-16-2025",
          "isExternal": true
        },
        {
          "text": "Set viewing reminders",
          "url": "planetspotter://calendar?week=mar7-16-2025",
          "isAppLink": true
        }
      ],
      "requiresPremium": false,
      "isHighlighted": true
    },
    {
      "id": "article-002",
      "title": "Venus Changes from Evening to Morning Star",
      "description": "Venus is about to disappear from our evening view. If you haven't looked at this bright planet recently, time is running out! On March 12th, Venus will be just under 18° from the Sun (this distance is called its elongation) and getting closer to the Sun by more than 1° each day. As Venus moves away, it will appear close to Mercury. The two inner planets will be closest to each other (5.5° apart) on March 12th.\n\nOn March 23rd, Venus will pass between Earth and the Sun (called inferior conjunction) and then move into the morning sky, becoming the \"Morning Star\" instead of the \"Evening Star.\" Ancient Romans called Venus \"Lucifer\" when seen in the morning and \"Vesper\" when seen in the evening.\n\nUsually, Venus is hidden in the Sun's glare for about a week around conjunction. During this time, careful observers might try to spot it during daylight using telescopes, while being very careful to avoid looking at the Sun. When Venus is closest to Earth, it appears largest in telescopes and shows a super-thin crescent shape.\n\nAround conjunction, when Venus appears nearly in the same direction as the Sun, the points (or cusps) of Venus's crescent can extend beyond 180° because sunlight bends through Venus's atmosphere. Look for these extensions when Venus is less than 2.5% lit (from March 16-29). Venus will be only 1.0% lit on March 22-23.\n\nVenus will reach its farthest point north of the Sun's path (the ecliptic) on March 18th, sitting 8.5° north. Since this happens just before conjunction, Venus will pass well north of the Sun, making it easier (and safer) to spot in daylight.\n\nIf you have very sharp vision, you might even be able to see Venus's crescent shape without a telescope. The human eye can separate details as small as 60 arc-seconds (or 1 arc-minute). Venus reaches almost exactly that size (59.5 arc-seconds) on March 22-23.\n\nBecause Venus is so far north of the Sun's path, observers in mid-northern latitudes have a rare chance to see Venus in the morning sky while it's technically still the Evening Star. Look for Venus's last appearance in the evening around March 18th. Then on March 21st, you can start looking for it before sunrise, but it will be very low on the horizon (\"in the mud\").\nCredit: Sky & Telescope",
      "credit": "By Bob King (March 12, 2025)",
      "shortDescription": "How to watch Venus as it moves from the evening to the morning sky",
      "dateTime": "2025-03-12T00:00:00Z",
      "endDateTime": "2025-03-23T23:59:59Z",
      "category": "planets",
      "priority": 2,
      "expirationDate": "2025-03-24T12:00:00Z",
      "images": [
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/venus_1.jpg",
          "type": "main",
          "altText": "Venus viewed from earth"
        },
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/venus_2.jpg",
          "type": "photo",
          "altText": "Venus path around the year"
        },
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/venus_3.jpg",
          "type": "map",
          "altText": "Venus in space"
        }
      ],
      "links": [
        {
          "text": "View full article",
          "url": "https://skyandtelescope.org/observing/venus-evening-to-morning-star-2025",
          "isExternal": true
        },
        {
          "text": "Set viewing reminder",
          "url": "planetspotter://reminder?event=venus-conjunction-2025",
          "isAppLink": true
        }
      ],
      "requiresPremium": false,
      "isHighlighted": true
    },
    {
      "id": "article-003",
      "title": "Watch the Total Lunar Eclipse Tonight (March 13-14)",
      "description": "An amazing total lunar eclipse will be visible tonight across North and South America, western Europe, and western Africa.\n\nFor people in North America, the eclipse happens late at night. The partial eclipse (when Earth's shadow first touches the Moon) begins at 1:09 a.m. Friday morning EDT. The total eclipse (when the Moon is completely inside Earth's shadow) starts at 2:26 a.m. EDT, reaches its middle at 2:59 a.m. EDT, and ends at 3:32 a.m. EDT. The partial eclipse ends completely at 4:48 a.m. EDT.\n\nDuring a lunar eclipse, Earth gets positioned directly between the Sun and the full Moon, casting our planet's shadow onto the Moon. The Moon turns a coppery-red color during totality (the time when it's fully in Earth's shadow), which lasts for about 66 minutes. This red color happens because Earth's atmosphere bends sunlight and filters out most colors except red, which reaches the Moon - it's like all Earth's sunrises and sunsets are being projected onto the Moon at once!\n\nThe Moon will be near its farthest point from Earth in its orbit (called apogee), making it appear slightly smaller than an average full Moon (sometimes called a \"minimoon\").\n\nThis is the first total lunar eclipse visible from this region since 2022. You don't need any special equipment to watch a lunar eclipse, but binoculars or a small telescope will let you see more details on the Moon's surface during the eclipse.\n\nUnlike solar eclipses, lunar eclipses are completely safe to look at with your naked eyes. You don't need any special eye protection to view a lunar eclipse.\nCredit: Sky & Telescope",
      "credit": "By Sky & Telescope Editors (March 13, 2025)",
      "shortDescription": "How to watch tonight's total lunar eclipse",
      "dateTime": "2025-03-13T21:00:00Z",
      "endDateTime": "2025-03-14T09:30:00Z",
      "category": "eclipse",
      "priority": 3,
      "expirationDate": "2025-03-15T12:00:00Z",
      "images": [
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/eclipse_1.jpg",
          "type": "main",
          "altText": "Total lunar eclipse sequence"
        },
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/eclipse_2.jpg",
          "type": "map",
          "altText": "World map showing eclipse visibility"
        },
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/eclipse_3.jpg",
          "type": "photo",
          "altText": "Earth's shadow on the lunar surface"
        }
      ],
      "links": [
        {
          "text": "View full article",
          "url": "https://skyandtelescope.org/observing/total-lunar-eclipse-march-2025",
          "isExternal": true
        },
        {
          "text": "Set viewing reminder",
          "url": "planetspotter://reminder?event=lunar-eclipse-2025",
          "isAppLink": true
        }
      ],
      "requiresPremium": false,
      "isHighlighted": true
    },
    {
      "id": "article-004",
      "title": "Celebrate the Vernal Equinox - The Astronomical Start of Spring",
      "description": "The vernal equinox (spring equinox) happens on March 20, 2025, at 10:33 a.m. EDT (14:33 UTC). This special day marks the astronomical beginning of spring in the Northern Hemisphere and fall in the Southern Hemisphere.\n\nWhat exactly is an equinox? During the equinox, the Sun passes directly above Earth's equator, bringing nearly equal amounts of day and night to all parts of our planet - about 12 hours each! The word \"equinox\" actually comes from Latin words meaning \"equal night.\"\n\nUnlike meteorological seasons that follow the calendar (where spring starts on March 1), astronomical seasons are based on Earth's position in its orbit and the tilt of its axis. Our planet's 23.5° tilt is what gives us our seasons. During the March equinox, neither hemisphere is tilted toward or away from the Sun.\n\nIf you're in the Northern Hemisphere, the March equinox brings earlier sunrises, later sunsets, softer winds, and budding plants. You'll notice the Sun rising a bit farther north on the horizon each day until the June solstice, when it reverses direction and starts moving south again.\n\nThe equinox is celebrated in many cultures around the world:\n\n- In Japan, the spring equinox (Shunbun no Hi) is a national holiday and part of a seven-day festival called Higan, when people visit family graves and honor their ancestors.\n\n- In Iran and many Central Asian countries, the equinox marks Nowruz (Persian New Year), a celebration that goes back over 3,000 years with feasts, family visits, and spring cleaning.\n\n- Many ancient monuments align with the equinoxes, including the famous pyramid at Chichen Itza in Mexico, where the setting sun creates a snake-like shadow on the steps.\n\nCelebrate the equinox yourself by joining local events like the one at the Herschel Museum of Astronomy in Bath, UK! The Bath Astronomers will be in the garden from 10 a.m. to 4 p.m. with solar telescopes to help you safely observe the Sun and learn more about our nearest star. This is happening at the same place where the planet Uranus was discovered in 1781.\n\nWant to mark the occasion at home? Try the egg-balancing challenge! While it's mostly a myth that eggs balance more easily on the equinox (you can actually do it any day with enough patience), it's still a fun tradition to try.\nCredit: Adapted from NASA",
      "credit": "By Jennifer A. Harbaugh & Lance D. Davis (March 18, 2025)",
      "shortDescription": "Learn about the spring equinox on March 20 and how to celebrate this astronomical event",
      "dateTime": "2025-03-20T14:33:00Z",
      "endDateTime": "2025-03-20T23:59:59Z",
      "category": "guide",
      "priority": 2,
      "expirationDate": "2025-03-21T12:00:00Z",
      "images": [
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/equinox_1.jpg",
          "type": "main",
          "altText": "Earth during spring equinox"
        },
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/equinox_2.jpg",
          "type": "map",
          "altText": "Diagram showing Earth's position during equinox"
        },
        {
          "url": "https://raw.githubusercontent.com/avinashkr29/SkySeekr-app/main/events/images/equinox_3.jpg",
          "type": "photo",
          "altText": "Cultural celebrations of spring equinox"
        }
      ],
      "links": [
        {
          "text": "View full article",
          "url": "https://skyandtelescope.org/observing/vernal-equinox-2025",
          "isExternal": true
        },
        {
          "text": "Set viewing reminder",
          "url": "planetspotter://reminder?event=vernal-equinox-2025",
          "isAppLink": true
        },
        {
          "text": "Bath Astronomers Event",
          "url": "https://bathastronomers.org.uk/events/vernal-equinox-2025",
          "isExternal": true
        }
      ],
      "requiresPremium": false,
      "isHighlighted": true
    }
  ],
  "categories": [
    {
      "id": "all",
      "name": "All Articles",
      "icon": "star.fill"
    },
    {
      "id": "guide",
      "name": "Sky Guides",
      "icon": "calendar"
    },
    {
      "id": "planets",
      "name": "Planets",
      "icon": "globe"
    },
    {
      "id": "eclipse",
      "name": "Eclipses",
      "icon": "moon.circle.fill"
    }
  ],
  "acknowledgement": "Article descriptions adapted from materials published by Sky & Telescope magazine (www.skyandtelescope.org) and NASA. These adaptations are used for educational purposes with proper attribution to the original sources. Images and specific timing information should be verified with local astronomical resources."
}
